###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/7c48d5b7-af6d-4456-9049-c7a29f4bfa75/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_listener.http will be created
  + resource "aws_alb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_alb_target_group.this will be created
  + resource "aws_alb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "todo-app-tg-dev"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-tg-dev"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-tg-dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "todo-app-dev-cloudwatch-log-group"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-dev-cloudwatch-log-group"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-dev-cloudwatch-log-group"
        }
    }

  # aws_cloudwatch_log_stream.todo_container_cloudwatch_logstream will be created
  + resource "aws_cloudwatch_log_stream" "todo_container_cloudwatch_logstream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "todo-app-dev-cloudwatch-log-group"
      + name           = "todo-app-dev-cloudwatch-log-stream"
    }

  # aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "keep last 3 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "todo-app-dev-repo"
    }

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "todo-app-dev-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "todo-app-dev-repo"
        }
      + tags_all             = {
          + "Name" = "todo-app-dev-repo"
        }
    }

  # aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "todo-app-dev-cluster"
      + tags               = {
          + "Name" = "todo-app-dev-fargate-cluster"
        }
      + tags_all           = {
          + "Name" = "todo-app-dev-fargate-cluster"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "todo-app-dev-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "todo-app-dev-container"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "DBHOST"
                          + value = "localhost"
                        },
                      + {
                          + name  = "DBPORT"
                          + value = "80"
                        },
                      + {
                          + name  = "REGION"
                          + value = "us-east-1"
                        },
                    ]
                  + essential        = true
                  + image            = "534731196878.dkr.ecr.us-east-1.amazonaws.com/todo-app-dev-repo"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "todo-app-dev-cloudwatch-log-group"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "/aws/ecs"
                        }
                    }
                  + name             = "todo-app-dev-container"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::534731196878:role/LabRole"
      + family                   = "todo-app-dev-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-dev-task"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-dev-task"
        }
      + task_role_arn            = "arn:aws:iam::534731196878:role/LabRole"
    }

  # aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "todo-app-alb-dev"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-alb-dev"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "Name"        = "todo-app-alb-dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.dynamic_subnets.aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + tags_all   = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + vpc_id     = (known after apply)
    }

  # module.dynamic_subnets.aws_network_acl_rule.public4_egress[0] will be created
  + resource "aws_network_acl_rule" "public4_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0] will be created
  + resource "aws_network_acl_rule" "public4_ingress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_route.public[0] will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + tags_all         = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public-use1a"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + tags_all                                       = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public-use1a"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "20m"
        }
    }

  # module.dynamic_subnets.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public-use1b"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + tags_all                                       = {
          + "Attributes" = "public"
          + "Name"       = "acc-dev-todo-app-public-use1b"
          + "Namespace"  = "acc"
          + "Stage"      = "dev"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "20m"
        }
    }

  # module.ecs_sg.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "ecs-primary"
          + "Name"       = "ecs-primary"
        }
      + tags_all               = {
          + "Attributes" = "ecs-primary"
          + "Name"       = "ecs-primary"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.ecs_sg.aws_security_group_rule.keyed["HTTP"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTP from inside the security group"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.ecs_sg.aws_security_group_rule.keyed["HTTPALB"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + description              = "Allow HTTP from ALB"
      + from_port                = 31000
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 61000
      + type                     = "ingress"
    }

  # module.ecs_sg.aws_security_group_rule.keyed["NODEJS"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ingress to node.js app"
      + from_port                = 3000
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # module.ecs_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs_sg.aws_security_group_rule.keyed["ssh"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow SSH from anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.ecs_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.ecs_sg.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = jsonencode(
                {
                  + HTTP               = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow HTTP from inside the security group"
                      + from_port                = 80
                      + ipv6_cidr_blocks         = []
                      + key                      = "HTTP"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 80
                      + type                     = "ingress"
                    }
                  + HTTPALB            = {
                      + cidr_blocks              = []
                      + description              = "Allow HTTP from ALB"
                      + from_port                = 31000
                      + ipv6_cidr_blocks         = []
                      + key                      = "HTTPALB"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = true
                      + source_security_group_id = null
                      + to_port                  = 61000
                      + type                     = "ingress"
                    }
                  + NODEJS             = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow ingress to node.js app"
                      + from_port                = 3000
                      + ipv6_cidr_blocks         = []
                      + key                      = "NODEJS"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 3000
                      + type                     = "ingress"
                    }
                  + _allow_all_egress_ = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow all egress"
                      + from_port                = 0
                      + ipv6_cidr_blocks         = [
                          + "::/0",
                        ]
                      + key                      = "_allow_all_egress_"
                      + prefix_list_ids          = []
                      + protocol                 = "-1"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 0
                      + type                     = "egress"
                    }
                  + ssh                = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow SSH from anywhere"
                      + from_port                = 22
                      + ipv6_cidr_blocks         = []
                      + key                      = "ssh"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 22
                      + type                     = "ingress"
                    }
                }
            )
        }
    }

  # module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "acc-dev-todo-app-default"
          + "Namespace" = "acc"
          + "Stage"     = "dev"
        }
      + tags_all               = {
          + "Name"      = "acc-dev-todo-app-default"
          + "Namespace" = "acc"
          + "Stage"     = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"      = "acc-dev-todo-app"
          + "Namespace" = "acc"
          + "Stage"     = "dev"
        }
      + tags_all = {
          + "Name"      = "acc-dev-todo-app"
          + "Namespace" = "acc"
          + "Stage"     = "dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"      = "acc-dev-todo-app"
          + "Namespace" = "acc"
          + "Stage"     = "dev"
        }
      + tags_all                             = {
          + "Name"      = "acc-dev-todo-app"
          + "Namespace" = "acc"
          + "Stage"     = "dev"
        }
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_id = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_alb_listener.http will be created%0A  + resource "aws_alb_listener" "http" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # aws_alb_target_group.this will be created%0A  + resource "aws_alb_target_group" "this" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + name                               = "todo-app-tg-dev"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-tg-dev"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-tg-dev"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 3%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A    }%0A%0A  # aws_cloudwatch_log_group.this will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "todo-app-dev-cloudwatch-log-group"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 0%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-dev-cloudwatch-log-group"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-dev-cloudwatch-log-group"%0A        }%0A    }%0A%0A  # aws_cloudwatch_log_stream.todo_container_cloudwatch_logstream will be created%0A  + resource "aws_cloudwatch_log_stream" "todo_container_cloudwatch_logstream" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + log_group_name = "todo-app-dev-cloudwatch-log-group"%0A      + name           = "todo-app-dev-cloudwatch-log-stream"%0A    }%0A%0A  # aws_ecr_lifecycle_policy.this will be created%0A  + resource "aws_ecr_lifecycle_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "keep last 3 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber = 3%0A                          + countType   = "imageCountMoreThan"%0A                          + tagStatus   = "any"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "todo-app-dev-repo"%0A    }%0A%0A  # aws_ecr_repository.this will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "todo-app-dev-repo"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name" = "todo-app-dev-repo"%0A        }%0A      + tags_all             = {%0A          + "Name" = "todo-app-dev-repo"%0A        }%0A    }%0A%0A  # aws_ecs_cluster.this will be created%0A  + resource "aws_ecs_cluster" "this" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "todo-app-dev-cluster"%0A      + tags               = {%0A          + "Name" = "todo-app-dev-fargate-cluster"%0A        }%0A      + tags_all           = {%0A          + "Name" = "todo-app-dev-fargate-cluster"%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = (known after apply)%0A          + value = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_service.this will be created%0A  + resource "aws_ecs_service" "this" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 50%0A      + desired_count                      = 2%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + health_check_grace_period_seconds  = 60%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "todo-app-dev-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "todo-app-dev-container"%0A          + container_port   = 3000%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = true%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.this will be created%0A  + resource "aws_ecs_task_definition" "this" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + environment      = [%0A                      + {%0A                          + name  = "DBHOST"%0A                          + value = "localhost"%0A                        },%0A                      + {%0A                          + name  = "DBPORT"%0A                          + value = "80"%0A                        },%0A                      + {%0A                          + name  = "REGION"%0A                          + value = "us-east-1"%0A                        },%0A                    ]%0A                  + essential        = true%0A                  + image            = "534731196878.dkr.ecr.us-east-1.amazonaws.com/todo-app-dev-repo"%0A                  + logConfiguration = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-group         = "todo-app-dev-cloudwatch-log-group"%0A                          + awslogs-region        = "us-east-1"%0A                          + awslogs-stream-prefix = "/aws/ecs"%0A                        }%0A                    }%0A                  + name             = "todo-app-dev-container"%0A                  + portMappings     = [%0A                      + {%0A                          + containerPort = 3000%0A                          + hostPort      = 3000%0A                          + protocol      = "tcp"%0A                        },%0A                    ]%0A                },%0A            ]%0A        )%0A      + cpu                      = "512"%0A      + execution_role_arn       = "arn:aws:iam::534731196878:role/LabRole"%0A      + family                   = "todo-app-dev-task"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-dev-task"%0A        }%0A      + tags_all                 = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-dev-task"%0A        }%0A      + task_role_arn            = "arn:aws:iam::534731196878:role/LabRole"%0A    }%0A%0A  # aws_lb.this will be created%0A  + resource "aws_lb" "this" {%0A      + arn                        = (known after apply)%0A      + arn_suffix                 = (known after apply)%0A      + desync_mitigation_mode     = "defensive"%0A      + dns_name                   = (known after apply)%0A      + drop_invalid_header_fields = false%0A      + enable_deletion_protection = false%0A      + enable_http2               = true%0A      + enable_waf_fail_open       = false%0A      + id                         = (known after apply)%0A      + idle_timeout               = 60%0A      + internal                   = false%0A      + ip_address_type            = (known after apply)%0A      + load_balancer_type         = "application"%0A      + name                       = "todo-app-alb-dev"%0A      + preserve_host_header       = false%0A      + security_groups            = (known after apply)%0A      + subnets                    = (known after apply)%0A      + tags                       = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-alb-dev"%0A        }%0A      + tags_all                   = {%0A          + "Environment" = "dev"%0A          + "Name"        = "todo-app-alb-dev"%0A        }%0A      + vpc_id                     = (known after apply)%0A      + zone_id                    = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl.public[0] will be created%0A  + resource "aws_network_acl" "public" {%0A      + arn        = (known after apply)%0A      + egress     = (known after apply)%0A      + id         = (known after apply)%0A      + ingress    = (known after apply)%0A      + owner_id   = (known after apply)%0A      + subnet_ids = (known after apply)%0A      + tags       = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + tags_all   = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + vpc_id     = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl_rule.public4_egress[0] will be created%0A  + resource "aws_network_acl_rule" "public4_egress" {%0A      + cidr_block     = "0.0.0.0/0"%0A      + egress         = true%0A      + from_port      = 0%0A      + id             = (known after apply)%0A      + network_acl_id = (known after apply)%0A      + protocol       = "-1"%0A      + rule_action    = "allow"%0A      + rule_number    = 100%0A      + to_port        = 0%0A    }%0A%0A  # module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0] will be created%0A  + resource "aws_network_acl_rule" "public4_ingress" {%0A      + cidr_block     = "0.0.0.0/0"%0A      + egress         = false%0A      + from_port      = 0%0A      + id             = (known after apply)%0A      + network_acl_id = (known after apply)%0A      + protocol       = "-1"%0A      + rule_action    = "allow"%0A      + rule_number    = 100%0A      + to_port        = 0%0A    }%0A%0A  # module.dynamic_subnets.aws_route.public[0] will be created%0A  + resource "aws_route" "public" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table.public[0] will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + tags_all         = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.dynamic_subnets.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/19"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = "ip-name"%0A      + tags                                           = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public-use1a"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + tags_all                                       = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public-use1a"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "20m"%0A        }%0A    }%0A%0A  # module.dynamic_subnets.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.32.0/19"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = "ip-name"%0A      + tags                                           = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public-use1b"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + tags_all                                       = {%0A          + "Attributes" = "public"%0A          + "Name"       = "acc-dev-todo-app-public-use1b"%0A          + "Namespace"  = "acc"%0A          + "Stage"      = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "20m"%0A        }%0A    }%0A%0A  # module.ecs_sg.aws_security_group.cbd[0] will be created%0A  + resource "aws_security_group" "cbd" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Attributes" = "ecs-primary"%0A          + "Name"       = "ecs-primary"%0A        }%0A      + tags_all               = {%0A          + "Attributes" = "ecs-primary"%0A          + "Name"       = "ecs-primary"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.ecs_sg.aws_security_group_rule.keyed["HTTP"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow HTTP from inside the security group"%0A      + from_port                = 80%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 80%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_sg.aws_security_group_rule.keyed["HTTPALB"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + description              = "Allow HTTP from ALB"%0A      + from_port                = 31000%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = true%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 61000%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_sg.aws_security_group_rule.keyed["NODEJS"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow ingress to node.js app"%0A      + from_port                = 3000%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 3000%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all egress"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + ipv6_cidr_blocks         = [%0A          + "::/0",%0A        ]%0A      + prefix_list_ids          = []%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.ecs_sg.aws_security_group_rule.keyed["ssh"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow SSH from anywhere"%0A      + from_port                = 22%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 22%0A      + type                     = "ingress"%0A    }%0A%0A  # module.ecs_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created%0A  + resource "null_resource" "sync_rules_and_sg_lifecycles" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "sg_ids" = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs_sg.random_id.rule_change_forces_new_security_group[0] will be created%0A  + resource "random_id" "rule_change_forces_new_security_group" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 3%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A      + keepers     = {%0A          + "rules" = jsonencode(%0A                {%0A                  + HTTP               = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow HTTP from inside the security group"%0A                      + from_port                = 80%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "HTTP"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 80%0A                      + type                     = "ingress"%0A                    }%0A                  + HTTPALB            = {%0A                      + cidr_blocks              = []%0A                      + description              = "Allow HTTP from ALB"%0A                      + from_port                = 31000%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "HTTPALB"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = true%0A                      + source_security_group_id = null%0A                      + to_port                  = 61000%0A                      + type                     = "ingress"%0A                    }%0A                  + NODEJS             = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow ingress to node.js app"%0A                      + from_port                = 3000%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "NODEJS"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 3000%0A                      + type                     = "ingress"%0A                    }%0A                  + _allow_all_egress_ = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow all egress"%0A                      + from_port                = 0%0A                      + ipv6_cidr_blocks         = [%0A                          + "::/0",%0A                        ]%0A                      + key                      = "_allow_all_egress_"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "-1"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 0%0A                      + type                     = "egress"%0A                    }%0A                  + ssh                = {%0A                      + cidr_blocks              = [%0A                          + "0.0.0.0/0",%0A                        ]%0A                      + description              = "Allow SSH from anywhere"%0A                      + from_port                = 22%0A                      + ipv6_cidr_blocks         = []%0A                      + key                      = "ssh"%0A                      + prefix_list_ids          = []%0A                      + protocol                 = "tcp"%0A                      + security_groups          = []%0A                      + self                     = null%0A                      + source_security_group_id = null%0A                      + to_port                  = 22%0A                      + type                     = "ingress"%0A                    }%0A                }%0A            )%0A        }%0A    }%0A%0A  # module.vpc.aws_default_security_group.default[0] will be created%0A  + resource "aws_default_security_group" "default" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name"      = "acc-dev-todo-app-default"%0A          + "Namespace" = "acc"%0A          + "Stage"     = "dev"%0A        }%0A      + tags_all               = {%0A          + "Name"      = "acc-dev-todo-app-default"%0A          + "Namespace" = "acc"%0A          + "Stage"     = "dev"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.vpc.aws_internet_gateway.default[0] will be created%0A  + resource "aws_internet_gateway" "default" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name"      = "acc-dev-todo-app"%0A          + "Namespace" = "acc"%0A          + "Stage"     = "dev"%0A        }%0A      + tags_all = {%0A          + "Name"      = "acc-dev-todo-app"%0A          + "Namespace" = "acc"%0A          + "Stage"     = "dev"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.default[0] will be created%0A  + resource "aws_vpc" "default" {%0A      + arn                                  = (known after apply)%0A      + assign_generated_ipv6_cidr_block     = false%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name"      = "acc-dev-todo-app"%0A          + "Namespace" = "acc"%0A          + "Stage"     = "dev"%0A        }%0A      + tags_all                             = {%0A          + "Name"      = "acc-dev-todo-app"%0A          + "Namespace" = "acc"%0A          + "Stage"     = "dev"%0A        }%0A    }%0A%0APlan: 30 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + vpc_id = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @carolinanonato, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deployment - Dev`*